// Title: MSHTA Successful outgooing conneciton to public IP
// Author: Jan Rezab
// Date: 25/06/2026
// Reference: https://mc.merill.net/message/MC1266905
// Description: Detects a successful outgooing connection to public IP.
DeviceNetworkEvents
| where InitiatingProcessFileName == "mshta.exe"
| where RemoteIPType == "Public"
| where ActionType == "ConnectionSuccess"